return {
  {
    "folke/snacks.nvim",
    opts = {
      dashboard = {
        preset = {
          keys = {
            { key = "p", action = "<Leader>cpr", icon = "", desc = "Receive Problem" },
            { key = "C", action = "<Leader>cpc", icon = "", desc = "Receive Contest" },
            { key = "e", action = "<Leader>ta",  icon = "", desc = "Leetcode"        },
            { key = "z", action = "<Leader>m",   icon = "", desc = "Zoxide"          },
            { key = "c", action = ":lua Snacks.dashboard.pick('files', {cwd = vim.fn.stdpath('config')})", icon = "", desc = "Config" },
            { key = "l", action = ":Lazy", enabled = package.loaded.lazy ~= nil, icon = "󰒲", desc = "Lazy" },
          },
          header = table.concat({
            "██╗     ██╗███╗   ██╗██╗   ██╗██╗███████╗██╗   ██╗",
            "██║     ██║████╗  ██║╚██╗ ██╔╝██║██╔════╝██║   ██║",
            "██║     ██║██╔██╗ ██║ ╚████╔╝ ██║███████╗██║   ██║",
            "██║     ██║██║╚██╗██║  ╚██╔╝  ██║╚════██║██║   ██║",
            "███████╗██║██║ ╚████║   ██║   ██║███████║╚██████╔╝",
            "╚══════╝╚═╝╚═╝  ╚═══╝   ╚═╝   ╚═╝╚══════╝ ╚═════╝ ",
          }, "\n"),
        },
      },
    },
  },
}